---
kind: property
id: P:Autodesk.Revit.DB.ExportPatternInfo.DestinationPatternName
source: html/94d6e4e8-d326-8c33-11c0-47243c31cb81.htm
---
# Autodesk.Revit.DB.ExportPatternInfo.DestinationPatternName Property

The destination pattern name (the name of the pattern in the exported format).

## Syntax (C#)
```csharp
public string DestinationPatternName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null